AI4CFD_export/freecad_addon/AI4CFD/vendor/CfdOF/Data/TestFiles/cases/block/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 83333.33333333334;

boundaryField
{

    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type        totalPressure;
        p0          uniform 0.0;
        value       $internalField;
    }

    wall
    {
        type        zeroGradient;
    }

    slip
    {
        type        zeroGradient;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
